[
	{
		"title": "Hack Your Limits with Hackathons",
		"excerpt": "Hackathons are more than just competitions; they are transformative experiences that push you beyond your limits, allow you to experiment with new technologies, and connect you with amazing people. Whether you win or not, the real value lies in the growth, learning, and relationships you build along the way. If you haven’t yet participated in a hackathon, I encourage you to dive in — you might just discover a passion that will propel you forward in your tech journey.",
		"content": "Have you ever heard about hackathon? Maybe you’ve already participated in one, or perhaps even won one? In this article, I’ll share how hackathons have become my passion and why they might just become yours too!\n\nA hackathon is more than just a competition; it’s an intense, fast-paced challenge where you and your team create a tech solution to address real-world problems. What makes it thrilling is the race against the clock — you and your team usually have only 3 to 7 days to bring your idea. But it’s not just about building and creating something; you also need to pitch your solution to convince the judges.\n\n![Me and My Team Pitching Idea](/assets/1767365402250-playbox-pitching-day.webp)\n\n# Hack the Limit!\nWhat draws me to hackathons is the constant challenge to push my limits and deliver the best possible solution. With just 3–5 members on my team, we have to build a tech solution from scratch and ensure we deliver a solid MVP (Minimum Viable Product) during our pitch. The growth I’ve experienced from my first hackathon to my most recent one is significant — not only in terms of coding skills but also in how I communicate, present ideas, and empathize with others. Hackathons are more than just technical challenges; they’re opportunities to develop a well-rounded skill set.\n\nFor me, a hackathon is a bar-raising event. It’s not just about competing with other teams but also about surpassing what I’ve built before. I constantly challenge myself to improve, even if things don’t always work out as planned. This drive to break my own limits and push even harder keeps me motivated.\n\n![Me and My Friend Building Our Tech Solution in Hackathon](/assets/1767365495544-garuda-hack.webp)\n\n# Your Own Laboratory\nParticipating in a hackathon is like having my own laboratory, where I can unleash all my creativity and experiment freely. I’ve learned a lot of new tech stacks through hackathons, and nothing holds me back from trying something new here 😁 It’s a place where I can explore solutions using technologies I want to learn, without any of the usual constraints.\n\nHackathons are ideal if you want to learn a new tech stack. In a work or academic setting, you might not always have the freedom or confidence to explore something new. But in a hackathon, you have the freedom to try out different approaches. So, hackathons offer the perfect environment to experiment and grow.\n\nIt’s not just always about coding experimentation either. I’ve also learned about design, created pitch decks, and presented my ideas to judges during hackathons. There’s so much room to experiment, and I believe it has really helped me grow and expand my creativity.\n\n# More Than Just Winning a Competition\nWinning is undoubtedly one of the best parts of participating in a competition. The thrill of hearing your name called out by the MC, the satisfaction of receiving prizes, and knowing that all your hard work has paid off — it’s an incredible feeling. But for me, that’s not the best part of participating in a hackathon.\n\n![My First Win in Hackathon Competition](/assets/1767365569263-first-winning-hackathon.webp)\n\nFor me, the best part of participating in a hackathon is meeting and collaborating with new people. During these events, I’ve had the opportunity to team up with talented individuals — experts in design, skilled coders, and even entrepreneurs who have already established businesses and won multiple competitions.\n\nI’ve learned so much from them. Besides building something together, we have meaningful discussions, gain new perspectives, and make connections that often lead to future teamwork in competitions, projects, or even business ventures. That’s why I believe that meeting and collaborating with new people is more valuable than just winning the competition. The connections and opportunities that come from these experiences are worth more than any prize.\n\n![My Last Recent Hackathon That I Participated](/assets/1767365643759-last-hackathon.webp)\n\nHackathons are more than just competitions; they are transformative experiences that push you beyond your limits, allow you to experiment with new technologies, and connect you with amazing people. Whether you win or not, the real value lies in the growth, learning, and relationships you build along the way. If you haven’t yet participated in a hackathon, I encourage you to dive in — you might just discover a passion that will propel you forward in your tech journey.\n",
		"category": "Career",
		"readTime": "4 min read",
		"author": "Riandy Hasan",
		"date": "2024-08-27",
		"id": "hack-your-limits-with-hackathons"
	}
]
